<?php
return [
    'login_success' => 'تم تسجيل الدخول بنجاح.',
    'logout_success' => 'تم تسجيل الخروج بنجاح.',
    'register_success' => 'تم إنشاء الحساب بنجاح.',
    'failed' => 'البريد الالكتروني أو كلمة المرور غير صحيحة.',
    'not_authorized' => 'المستخدم لا يملك الإذن لتسجيل الدخول كـ',
    'admin' => 'أدمن',
    'client_wrong_credentials' => 'البريد الالكتروني أو كلمة المرور غير صحيحين',
    'admin_wrong_credentials' => 'البريد الالكتروني أو كلمة المرور غير صحيحين',
    'no_token' => 'التوكن غير صالحة',
    'not_allowed' => 'ليس لديك صلاحية للوصول لهذه النقطة',
    'no_permission' => 'ليس لديك الصلاحيات للقيام بهذا الإجراء.',

    'name' => [
        'required' => 'الاسم مطلوب.',
        'string' => 'يجب أن يكون الاسم نصاً.',
        'max' => 'يجب ألا يتجاوز الاسم 255 حرفاً.',
        'unique' => 'الاسم مستخدم بالفعل'
    ],

    'email' => [
        'required' => 'البريد الإلكتروني مطلوب.',
        'email' => 'يجب أن يكون البريد الإلكتروني صالحاً.',
        'unique' => 'البريد الإلكتروني مستخدم بالفعل.',
        'exists' => 'البريد الالكتروني غير موجود.',
    ],


    'gender' => [
        'required' => 'الجنس مطلوب.',
        'in' => 'يجب أن يكون الجنس ذكر أو أنثى.',
    ],

    'lang' => [
        'required' => 'اللغة مطلوبة.',
        'in' => 'يجب أن تكون اللغة عربية أو إنجليزية.',
    ],

    'password' => [
        'required' => 'كلمة المرور مطلوبة.',
        'string' => 'يجب أن تكون كلمة المرور نصاً.',
        'min' => 'يجب ألا تقل كلمة المرور عن 8 أحرف.',
        'confirmed' => 'تأكيد كلمة المرور غير متطابق.',
    ],

    'profile_photo' => [
        'image' => 'يجب أن يكون الملف صورة.',
        'mimes' => 'يجب أن تكون الصورة بصيغة jpeg, png, jpg, gif, svg.',
        'max' => 'يجب ألا يتجاوز حجم الصورة الحد المسموح.',
    ],

];
