<?php

return [
    'index' => 'تم جلب الأقسام بنجاح.',
    'created' => 'تم إنشاء القسم بنجاح.',
    'updated' => 'تم تحديث القسم بنجاح.',
    'deleted' => 'تم حذف القسم بنجاح.',
    'found' => 'تم العثور على القسم بنجاح.',

    'ar_name' => [
        'required' => 'اسم القسم بالعربية مطلوب.',
        'string' => 'اسم القسم بالعربية يجب أن يكون نصاً.',
        'max' => 'اسم القسم بالعربية يجب ألا يتجاوز 255 حرفاً.',
        'unique' => 'هذا الاسم العربي موجود بالفعل في هذا المستوى.',
        'regex' => 'اسم الفئة بالعربية يجب أن يحتوي على أحرف عربية فقط.',
    ],

    'en_name' => [
        'required' => 'اسم القسم بالإنجليزية مطلوب.',
        'string' => 'اسم القسم بالإنجليزية يجب أن يكون نصاً.',
        'max' => 'اسم القسم بالإنجليزية يجب ألا يتجاوز 255 حرفاً.',
        'unique' => 'هذا الاسم الإنجليزي موجود بالفعل في هذا المستوى.',
        'regex' => 'اسم الفئة بالإنجليزية يجب أن يحتوي على أحرف إنجليزية فقط.',
    ],

];
